In [2]:
import akshare as ak
import pandas as pd
import matplotlib.pyplot as plt

stock_zh_a_daily_hfq_df = ak.stock_zh_a_daily(symbol="sh600570", start_date="19910403", end_date="20240417", adjust="hfq")
stock_zh_a_daily_qfq_df = ak.stock_zh_a_daily(symbol="sh600570", start_date="19910403", end_date="20240417", adjust="qfq")

In [2]:
stock_zh_a_daily_qfq_df['amount']-stock_zh_a_daily_qfq_df['amount'].shift(1)

0               NaN
1       -80157307.0
2       -41209872.0
3        12775876.0
4       -16023956.0
           ...
4830   -107180448.0
4831    -38644205.0
4832    275890909.0
4833   -138861931.0
4834     59528101.0
Name: amount, Length: 4835, dtype: float64

In [32]:
stock_zh_a_daily_qfq_df['amount_incr'] = stock_zh_a_daily_qfq_df['amount']-stock_zh_a_daily_qfq_df['amount'].shift(1)

In [35]:
stock_zh_a_daily_qfq_df['ret']=stock_zh_a_daily_qfq_df.close/stock_zh_a_daily_qfq_df.close.shift(1)-1

In [6]:
import talib as ta
df = stock_zh_a_daily_qfq_df
df.head(5)

,date,open,high,low,close,volume,amount,outstanding_share,turnover
0,2003-12-16,0.45,0.47,0.44,0.45,7204181.0,145332638.0,17000000.0,0.423775
1,2003-12-17,0.43,0.43,0.41,0.41,3477866.0,65175331.0,17000000.0,0.204580
2,2003-12-18,0.40,0.41,0.40,0.40,1318173.0,23965459.0,17000000.0,0.077540
3,2003-12-19,0.40,0.41,0.38,0.39,2108017.0,36741335.0,17000000.0,0.124001
4,2003-12-22,0.38,0.39,0.38,0.39,1213452.0,20717379.0,17000000.0,0.071380

In [8]:
high,low,close,amount = df.high.values,df.low.values,df.close.values,df.amount.values
df['mfi']=ta.MFI(high,low,close,amount,15)
df.tail(10)
ak.stock_zh_a_daily

,date,open,high,low,close,volume,amount,outstanding_share,turnover,mfi
4825,2024-04-02,23.20,23.22,22.78,22.92,23176709.0,532097651.0,1.900006e+09,0.012198,53.180067
4826,2024-04-03,22.86,23.08,22.20,22.23,39972072.0,900291051.0,1.900006e+09,0.021038,46.416485
4827,2024-04-08,22.00,22.07,21.36,21.37,39526854.0,857071983.0,1.900006e+09,0.020804,46.915714
4828,2024-04-09,21.50,21.68,21.26,21.52,20885659.0,447984860.0,1.900006e+09,0.010992,48.144839
4829,2024-04-10,21.45,21.46,20.70,20.86,26683343.0,559374670.0,1.900006e+09,0.014044,41.015475
4830,2024-04-11,20.74,21.20,20.68,20.87,21538741.0,452194222.0,1.900006e+09,0.011336,35.851706
4831,2024-04-12,20.87,21.06,20.46,20.52,20013324.0,413550017.0,1.894145e+09,0.010566,29.161493
4832,2024-04-15,20.61,21.38,20.36,21.02,32964261.0,689440926.0,1.894145e+09,0.017403,18.805757
4833,2024-04-16,20.98,21.38,20.40,20.46,26463104.0,550578995.0,1.894145e+09,0.013971,20.650641
4834,2024-04-17,20.59,21.10,20.59,21.03,29192074.0,610107096.0,1.894145e+09,0.015412,27.936694

In [49]:
df.tail()

,date,open,high,low,close,volume,amount,outstanding_share,turnover,mfi
date,,,,,,,,,,
2024-04-11,2024-04-11,20.74,21.20,20.68,20.87,21538741.0,452194222.0,1.900006e+09,0.011336,35.851706
2024-04-12,2024-04-12,20.87,21.06,20.46,20.52,20013324.0,413550017.0,1.894145e+09,0.010566,29.161493
2024-04-15,2024-04-15,20.61,21.38,20.36,21.02,32964261.0,689440926.0,1.894145e+09,0.017403,18.805757
2024-04-16,2024-04-16,20.98,21.38,20.40,20.46,26463104.0,550578995.0,1.894145e+09,0.013971,20.650641
2024-04-17,2024-04-17,20.59,21.10,20.59,21.03,29192074.0,610107096.0,1.894145e+09,0.015412,27.936694

In [71]:
# df.iloc[0:4]
# df.loc[df.index[:10]]

df.iloc[0:10]

,date,open,high,low,close,volume,amount,outstanding_share,turnover,mfi
date,,,,,,,,,,
2003-12-16,2003-12-16,0.45,0.47,0.44,0.45,7204181.0,145332638.0,17000000.0,0.423775,NaN
2003-12-17,2003-12-17,0.43,0.43,0.41,0.41,3477866.0,65175331.0,17000000.0,0.204580,NaN
2003-12-18,2003-12-18,0.40,0.41,0.40,0.40,1318173.0,23965459.0,17000000.0,0.077540,NaN
2003-12-19,2003-12-19,0.40,0.41,0.38,0.39,2108017.0,36741335.0,17000000.0,0.124001,NaN
2003-12-22,2003-12-22,0.38,0.39,0.38,0.39,1213452.0,20717379.0,17000000.0,0.071380,NaN
2003-12-23,2003-12-23,0.39,0.39,0.38,0.39,691433.0,11905183.0,17000000.0,0.040673,NaN
2003-12-24,2003-12-24,0.38,0.39,0.38,0.38,757444.0,12909285.0,17000000.0,0.044556,NaN
2003-12-25,2003-12-25,0.39,0.39,0.38,0.39,622782.0,10738937.0,17000000.0,0.036634,NaN
2003-12-26,2003-12-26,0.39,0.41,0.39,0.40,1312989.0,23444661.0,17000000.0,0.077235,NaN
2003-12-29,2003-12-29,0.40,0.40,0.39,0.39,546522.0,9636070.0,17000000.0,0.032148,NaN